{"inkVersion":20,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start":["^I see you've arrived at your new place. Splendid.","\n","^It's a Bobatea shop.","\n","^As you probably see.","\n","^Read the menu and the different options, because you have OPTIONS.","\n","^Oh, boy.","\n","^To ASCEND you have to be a Very Good Waiter at this place.","\n","^Do your job well. That is your Quest.","\n","^DON'T BE AFRAID. I SEE YOU.","\n","^...","\n","^Sorry, that was the Boss.","\n","^What else?","\n","^Don't tell the humans who you are. That's important.","\n","^I'll be in contact. Cannot wait for you to ASCEND.","\n",{"->":"Tutorial"},{"#f":1}],"Tutorial":["^Just serve them. Talk to them first.","\n","^Good, good...","\n","^We should serve them.","\n","^Many different things makes a Bobatea great.","\n","^The current best option depends on the weather and the taste of the guest.","\n","^Someone prefers lime, the other liche...","\n","^It might depends on their stance towards life. Are they happy? Are they pessimistic?","\n","^... and it may depend on their current situation.","\n","^Did you listen to their problem?","\n","^But...","\n","^DO NOT HINDER I'm WITH YOU","\n","^Boss, again, sorry.","\n","^Just mix a bobatea. They will tell you, if they liked it or not.","\n","^That's the spirit!","\n","^Do not worry, next time you will do better.","\n","^Oh, ... they might come back less frequently, if they didn't like it.","\n","^Forgot to tell. My bad.","\n",{"->":"Trigger_1"},{"#f":1}],"Trigger_1":["^Ohh, nice, he /she /they is/are your friend now.","\n","^We are not making friend with humans, you should now.","\n","^Your job is to make tea.","\n",{"->":"Trigger_2"},{"#f":1}],"Trigger_2":["^Did you notice that they are/ she is / he is in a deeper problem now?","\n","^Why could it happen?","\n","^Did you... ahem.. interact with them in a way that would change their life?","\n","^Do not forget who you are.","\n","^Do not forget what our touch can do the mundane.","\n",{"->":"3_problem"},{"#f":1}],"3_problem":["^It DID get worse. I am starting to feel sorry for them.","\n","^You know, if you give them advice, their problems will get worse.","\n","^THAT IS THE WAY.","\n","^We don't mix well with the unholy mundane.","\n","^Everything you do touches their life.","\n","^Just give them tea.","\n",{"->":"Epic_problem"},{"#f":1}],"Epic_problem":["^WHAT DID I SAY?","\n","^I told you that you shouldn't interfere!!!","\n","^Look, what you did.","\n","^And no, you shouldn't expose yourself. That won't end well.","\n","^Do not think about using your power.","\n","^IT IS FORBIDDEN, DO YOU HEAR ME?","\n","^Let them suffer and feel the shame - you were the one who caused this.","\n",{"->":"Epic_usage"},{"#f":1}],"Epic_usage":["^Nononononono.","\n","^You shouldn't have done this.","\n","^Always big on flaming swords, were you?","\n","^You will expose your real form too soon... and that's not good for business.","\n","^If they recognise you, you cannot stay.","\n","^I SEE YOU.","\n","^They will see you (boss again).","\n","^Please, just do your job and ASCEND.","\n",{"->":"Bobatea_end"},{"#f":1}],"Bobatea_end":["^You have finished your task - to be a good server at the Heavenly Bobatea shop!","\n","^Yes, you can be happy and proud of yourself!","\n","^You gave your guests enough good bobateas, so you can now come back to the Heavens, after you made the bobatea shop quite a local favourite!","\n","ev",{"VAR?":"epic_used"},2,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^However, you did loose some of your Humanity with too Bright Acts of Justice.","\n","^It is our Task to remind you that it is not up to you to solve the problems of the people. You may have noticed that your actions had consequencies - the bigger the act, the bigger the consequence. That's how it were, and how it is. And how It Will Be.","\n","^You Don't Have To Be EveryWhere.","\n","^Just Be Where You Are.","\n",{"->":".^.^.^.12"},null]}],"nop","\n",{"->":"Reveal_ending"},{"#f":1}],"Reveal_ending":["^REPORT TO HOME ASAP","\n","^It came before our eyes and understanding that you became just too involved with the mundane lives and problems of your guests.","\n","^And you forgot about your task at hand: to be a good bartender at the Heavenly Bobatea.","\n","^We did not ask You To Solve Problems.","\n","^We did not Expect You to Reveal youSElF","\n","^yOU aRe NOt ReAdy.","\n","^YoU wILL nOT ascEND.","\n","end",{"#f":1}],"global decl":["ev",3,{"VAR=":"epic_used"},"/ev","end",null],"#f":1}],"listDefs":{}}